Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.automation.amp.note
source: cmux installs and refreshes Amp hooks automatically in cmux terminals. They no-op outside cmux terminals. When disabled, the installed Amp plugin stays inactive without needing to be removed.
ar: يثبّت cmux خطافات Amp ويحدّثها تلقائيًا في طرفيات cmux. ولا تنفّذ أي إجراء خارج طرفيات cmux. عند تعطيلها، تظل إضافة Amp المثبّتة غير نشطة دون الحاجة إلى إزالتها.
bs: cmux automatski instalira i osvježava Amp hookove u cmux terminalima. Izvan cmux terminala ne rade ništa. Kada je onemogućeno, instalirani Amp dodatak ostaje neaktivan bez potrebe za uklanjanjem.
da: cmux installerer og opdaterer automatisk Amp-hooks i cmux-terminaler. De gør intet uden for cmux-terminaler. Når funktionen er deaktiveret, forbliver det installerede Amp-plugin inaktivt uden at skulle fjernes.
de: cmux installiert und aktualisiert Amp-Hooks automatisch in cmux-Terminals. Außerhalb von cmux-Terminals bleiben sie ohne Wirkung. Wenn die Integration deaktiviert ist, bleibt das installierte Amp-Plugin inaktiv und muss nicht entfernt werden.
es: cmux instala y actualiza automáticamente los hooks de Amp en los terminales de cmux. Fuera de los terminales de cmux, no hacen nada. Al desactivarlos, el plugin de Amp instalado permanece inactivo sin necesidad de eliminarlo.
fr: cmux installe et actualise automatiquement les hooks Amp dans les terminaux cmux. Ils restent sans effet en dehors des terminaux cmux. Lorsque cette option est désactivée, le plugin Amp installé reste inactif sans qu’il soit nécessaire de le supprimer.
it: cmux installa e aggiorna automaticamente gli hook di Amp nei terminali cmux. Al di fuori dei terminali cmux non eseguono alcuna operazione. Quando l’integrazione è disattivata, il plugin Amp installato rimane inattivo senza dover essere rimosso.
ja: cmuxターミナルでは、cmuxがAmpフックを自動的にインストールして更新します。cmuxターミナル外では動作しません。無効にすると、インストール済みのAmpプラグインは削除しなくても停止状態になります。
ko: cmux 터미널에서는 cmux가 Amp 훅을 자동으로 설치하고 갱신합니다. cmux 터미널 외부에서는 작동하지 않습니다. 비활성화하면 설치된 Amp 플러그인을 제거하지 않아도 비활성 상태로 유지됩니다.
nb: cmux installerer og oppdaterer Amp-hooks automatisk i cmux-terminaler. De gjør ingenting utenfor cmux-terminaler. Når integrasjonen er deaktivert, forblir den installerte Amp-utvidelsen inaktiv uten at den må fjernes.
pl: cmux automatycznie instaluje i odświeża hooki Amp w terminalach cmux. Poza terminalami cmux nie wykonują one żadnych działań. Po wyłączeniu zainstalowana wtyczka Amp pozostaje nieaktywna i nie trzeba jej usuwać.
pt_br: O cmux instala e atualiza automaticamente os hooks do Amp nos terminais do cmux. Fora dos terminais do cmux, eles não realizam nenhuma ação. Quando a integração é desativada, o plugin do Amp instalado permanece inativo sem precisar ser removido.
ru: cmux автоматически устанавливает и обновляет хуки Amp в терминалах cmux. Вне терминалов cmux они ничего не делают. Когда интеграция отключена, установленный плагин Amp остаётся неактивным, и удалять его не требуется.
th: cmux จะติดตั้งและอัปเดตฮุกของ Amp โดยอัตโนมัติในเทอร์มินัล cmux ฮุกเหล่านี้จะไม่ทำงานนอกเทอร์มินัล cmux เมื่อปิดใช้งาน ปลั๊กอิน Amp ที่ติดตั้งไว้จะยังคงไม่ทำงานโดยไม่จำเป็นต้องลบออก
tr: cmux, Amp kancalarını cmux terminallerinde otomatik olarak yükler ve yeniler. Bu kancalar cmux terminalleri dışında işlem yapmaz. Devre dışı bırakıldığında yüklü Amp eklentisi kaldırılması gerekmeden etkisiz kalır.
uk: cmux автоматично встановлює та оновлює хуки Amp у терміналах cmux. Поза терміналами cmux вони не виконують жодних дій. Коли інтеграцію вимкнено, встановлений плагін Amp залишається неактивним, і видаляти його не потрібно.
zh_hans: cmux 会在 cmux 终端中自动安装并刷新 Amp 钩子。这些钩子在 cmux 终端之外不会执行任何操作。禁用后，已安装的 Amp 插件会保持非活动状态，无需将其移除。
zh_hant: cmux 會在 cmux 終端機中自動安裝並更新 Amp 掛鉤。這些掛鉤在 cmux 終端機之外不會執行任何動作。停用後，已安裝的 Amp 外掛程式會維持非作用中狀態，無須將其移除。

# settings.automation.amp.subtitleOff
source: Amp runs without cmux integration.
ar: يعمل Amp دون تكامل مع cmux.
de: Amp läuft ohne cmux-Integration.
es: Amp se ejecuta sin la integración de cmux.
fr: Amp s’exécute sans intégration cmux.
ja: AmpはCmux連携なしで動作します。
ko: Amp가 cmux 연동 없이 실행됩니다.
zh_hans: Amp 在不集成 cmux 的情况下运行。
zh_hant: Amp 執行時不與 cmux 整合。

# settings.automation.amp.subtitleOn
source: Sidebar shows Amp agent status and notifications.
ar: يعرض الشريط الجانبي حالة عميل Amp وإشعاراته.
de: Die Seitenleiste zeigt den Status des Amp-Agenten sowie Benachrichtigungen an.
es: La barra lateral muestra el estado del agente Amp y sus notificaciones.
fr: La barre latérale affiche le statut de l’agent Amp et ses notifications.
ja: サイドバーにAmpエージェントのステータスと通知が表示されます。
ko: 사이드바에 Amp 에이전트 상태와 알림이 표시됩니다.
zh_hans: 侧边栏显示 Amp 代理状态和通知。
zh_hant: 側邊欄會顯示 Amp 代理程式狀態與通知。

# settings.automation.autoNamingAgent
source: Naming Agent
ar: وكيل التسمية
bs: Agent za imenovanje
da: Navngivningsagent
de: Benennungsagent
es: Agente de nombres
fr: Agent de nommage
it: Agente di denominazione
ja: 命名エージェント
ko: 이름 지정 에이전트
nb: Navngivingsagent
pl: Agent nazywania
pt_br: Agente de nomeação
ru: Агент именования
th: เอเจนต์ตั้งชื่อ
tr: Adlandırma aracısı
uk: Агент іменування
zh_hans: 命名代理
zh_hant: 命名代理

# settings.automation.autoNamingAgent.auto
source: Automatic
ar: تلقائي
bs: Automatski
da: Automatisk
de: Automatisch
es: Automático
fr: Automatique
it: Automatico
ja: 自動
ko: 자동
nb: Automatisk
pl: Automatycznie
pt_br: Automático
ru: Автоматически
th: อัตโนมัติ
tr: Otomatik
uk: Автоматично
zh_hans: 自动
zh_hant: 自動

# settings.automation.autoNamingAgent.requirement.auto
source: Each session is named by its own agent.
ar: يتم تسمية كل جلسة بواسطة العميل الخاص بها.
de: Jede Sitzung wird von ihrem eigenen Agenten benannt.
es: Cada sesión es nombrada por su propio agente.
fr: Chaque session est nommée par son propre agent.
ja: 各セッションはそのセッション自身のエージェントによって命名されます。
ko: 각 세션은 자체 에이전트에 의해 이름이 지정됩니다.
zh_hans: 每个会话由其自身的代理命名。
zh_hant: 每個工作階段皆由其專屬代理程式命名。

# settings.automation.autoNamingAgent.requirement.supported
source: %@ names every session. Requires its CLI on your PATH; if it can't produce a name, existing names are left unchanged.
ar: يقوم %@ بتسمية كل جلسة. يتطلب وجود واجهة خط الأوامر (CLI) الخاصة به في PATH الخاص بك؛ وإذا لم يتمكن من إنشاء اسم، تظل الأسماء الحالية دون تغيير.
de: %@ benennt jede Sitzung. Erfordert das zugehörige CLI in Ihrem PATH; wenn kein Name generiert werden kann, bleiben bestehende Namen unverändert.
es: %@ nombra cada sesión. Requiere su CLI en tu PATH; si no puede generar un nombre, los nombres existentes no se modificarán.
fr: %@ nomme chaque session. Nécessite sa CLI dans votre PATH ; s'il ne peut pas produire de nom, les noms existants restent inchangés.
ja: %@ がすべてのセッションを命名します。PATH にその CLI が必要です。名前を生成できない場合、既存の名前はそのまま保持されます。
ko: %@이(가) 모든 세션의 이름을 지정합니다. PATH에 해당 CLI가 있어야 합니다. 이름을 생성할 수 없는 경우 기존 이름은 변경되지 않은 상태로 유지됩니다.
zh_hans: %@ 为每个会话命名。需要其 CLI 在 PATH 中；如果无法生成名称，现有名称保持不变。
zh_hant: %@ 會命名每個工作階段。需要在您的 PATH 中有其 CLI；如果無法產生名稱，現有名稱將保持不變。

# settings.automation.autoNamingAgent.requirement.unsupported
source: %@ can't generate names yet, so cmux uses each session's own agent.
ar: لا يمكن لـ %@ توليد أسماء بعد، لذا يستخدم cmux العميل الخاص بكل جلسة.
de: %@ kann noch keine Namen generieren, daher verwendet cmux den eigenen Agenten der jeweiligen Sitzung.
es: %@ aún no puede generar nombres, por lo que cmux utiliza el propio agente de cada sesión.
fr: %@ ne peut pas encore générer de noms, cmux utilise donc le propre agent de chaque session.
ja: %@ はまだ名前を生成できないため、cmux は各セッション自身のエージェントを使用します。
ko: %@은(는) 아직 이름을 생성할 수 없으므로, cmux는 각 세션의 자체 에이전트를 사용합니다.
zh_hans: %@ 目前无法生成名称，因此 cmux 会使用每个会话自身的代理。
zh_hant: %@ 目前還無法產生名稱，因此 cmux 會使用每個工作階段專屬的代理程式。

# settings.automation.autoNamingAgent.section.other
source: Other agents
ar: عملاء آخرون
de: Andere Agenten
es: Otros agentes
fr: Autres agents
ja: その他のエージェント
ko: 기타 에이전트
zh_hans: 其他代理
zh_hant: 其他代理程式

# settings.automation.autoNamingAgent.section.supported
source: Supported
ar: مدعوم
de: Unterstützt
es: Compatibles
fr: Pris en charge
ja: 対応
ko: 지원됨
zh_hans: 已支持
zh_hant: 已支援

# settings.automation.autoNamingAgent.status.failed
source: %@ couldn't generate a name — it may be rate-limited, out of tokens, or signed out. Existing names are left unchanged.
ar: تعذر على %@ توليد اسم — قد يكون مقيد المعدل، أو نفدت الرموز المميزة لديه، أو تم تسجيل الخروج. تظل الأسماء الحالية دون تغيير.
de: %@ konnte keinen Namen generieren — eventuell gilt eine Ratenbegrenzung, es sind keine Token mehr vorhanden oder die Anmeldung fehlt. Bestehende Namen bleiben unverändert.
es: %@ no pudo generar un nombre; puede tener el límite de frecuencia excedido, haberse quedado sin tokens o haber cerrado sesión. Los nombres existentes no se modificarán.
fr: %@ n'a pas pu générer de nom — il est peut-être limité par le débit, à court de jetons ou déconnecté. Les noms existants restent inchangés.
ja: %@ は名前を生成できませんでした。レート制限、トークン不足、またはサインアウトの可能性があります。既存の名前はそのまま保持されます。
ko: %@이(가) 이름을 생성할 수 없습니다. 비율 제한이 초과되었거나, 토큰이 부족하거나, 로그아웃된 상태일 수 있습니다. 기존 이름은 변경되지 않은 상태로 유지됩니다.
zh_hans: %@ 无法生成名称 — 可能是被限流、令牌用尽或已退出登录。现有名称保持不变。
zh_hant: %@ 無法產生名稱 —— 它可能受到速率限制、權杖用盡或已登出。現有名稱將保持不變。

# settings.automation.autoNamingAgent.status.notInstalled
source: %@ isn't installed, so naming used each session's own agent.
ar: إنّ %@ غير مثبت، لذا تم استخدام العميل الخاص بكل جلسة للتسمية.
de: %@ ist nicht installiert, daher wurde für die Benennung der eigene Agent der jeweiligen Sitzung verwendet.
es: %@ no está instalado, por lo que la asignación de nombres utilizó el propio agente de cada sesión.
fr: %@ n'est pas installé, le nommage a donc utilisé le propre agent de chaque session.
ja: %@ がインストールされていないため、命名には各セッション自身のエージェントが使用されました。
ko: %@이(가) 설치되어 있지 않아 각 세션의 자체 에이전트를 사용하여 이름을 지정했습니다.
zh_hans: %@ 未安装，因此命名改用了每个会话自身的代理。
zh_hant: %@ 未安裝，因此命名使用每個工作階段專屬的代理程式。

# settings.automation.claudeCode
source: Claude Code Integration
ar: تكامل Claude Code
bs: Claude Code integracija
es: Integración con Claude Code
fr: Intégration Claude Code
it: Integrazione Claude Code
ja: Claude Code連携
ko: Claude Code 연동
nb: Claude Code-integrering
pl: Integracja z Claude Code
pt_br: Integração com Claude Code
ru: Интеграция с Claude Code
th: การผสานรวม Claude Code
tr: Claude Code Entegrasyonu
uk: Інтеграція з Claude Code
zh_hans: Claude Code 集成
zh_hant: Claude Code 整合

# settings.automation.claudeCode.customPath
source: Claude Binary Path
ar: مسار ملف Claude الثنائي
de: Claude-Binärpfad
es: Ruta del binario de Claude
fr: Chemin du binaire Claude
ja: Claudeバイナリパス
ko: Claude 바이너리 경로
zh_hans: Claude 二进制文件路径
zh_hant: Claude 二進位檔路徑

# settings.automation.claudeCode.customPath.placeholder
source: e.g. /usr/local/bin/claude
ar: مثال: /usr/local/bin/claude
de: z. B. /usr/local/bin/claude
es: p. ej., /usr/local/bin/claude
fr: par ex. /usr/local/bin/claude
ja: 例: /usr/local/bin/claude
ko: 예: /usr/local/bin/claude
zh_hans: 例如 /usr/local/bin/claude
zh_hant: 例如 /usr/local/bin/claude

# settings.automation.claudeCode.customPath.subtitle
source: Custom path to the claude binary. Leave empty to use PATH.
ar: مسار مخصص لملف claude الثنائي. اتركه فارغًا لاستخدام PATH.
de: Benutzerdefinierter Pfad zur Claude-Binärdatei. Leer lassen, um PATH zu verwenden.
es: Ruta personalizada al binario de claude. Déjela vacía para usar PATH.
fr: Chemin personnalisé vers le binaire claude. Laisser vide pour utiliser le PATH.
ja: claudeバイナリのカスタムパス。空欄の場合はPATHを使用します。
ko: claude 바이너리의 사용자 지정 경로입니다. PATH를 사용하려면 비워두세요.
zh_hans: claude 二进制文件的自定义路径。留空则使用 PATH。
zh_hant: Claude 二進位檔的自訂路徑。留空則使用 PATH。

# settings.automation.claudeCode.note
source: When enabled, cmux wraps the claude command to inject session tracking and notification hooks. Disable if you prefer to manage Claude Code hooks yourself.
ar: عند التفعيل، يغلّف cmux أمر claude لحقن تتبع الجلسة وخطافات الإشعارات. قم بالتعطيل إذا كنت تفضل إدارة خطافات Claude Code بنفسك.
bs: Kada je omogućeno, cmux omotava naredbu claude kako bi ubacio praćenje sesije i zakačke za obavještenja. Onemogućite ako preferirate sami upravljati Claude Code zakačkama.
da: Når aktiveret, wrapper cmux claude-kommandoen for at injicere sessionssporing og notifikationshooks. Deaktiver, hvis du foretrækker at administrere Claude Code-hooks selv.
de: Wenn aktiviert, umhüllt cmux den claude-Befehl, um Sitzungsverfolgung und Benachrichtigungs-Hooks einzufügen. Deaktivieren Sie dies, wenn Sie Claude Code-Hooks selbst verwalten möchten.
es: Cuando está activado, cmux envuelve el comando claude para inyectar seguimiento de sesión y hooks de notificación. Desactiva si prefieres gestionar los hooks de Claude Code tú mismo.
fr: Lorsque cette option est activée, cmux encapsule la commande claude pour injecter le suivi de session et les hooks de notification. Désactivez si vous préférez gérer les hooks Claude Code vous-même.
it: Quando abilitato, cmux avvolge il comando claude per iniettare il tracciamento della sessione e gli hook di notifica. Disabilita se preferisci gestire gli hook di Claude Code manualmente.
ja: 有効にすると、cmuxはclaudeコマンドをラップしてセッション追跡と通知フックを挿入します。Claude Codeのフックを自分で管理する場合は無効にしてください。
ko: 활성화하면 cmux가 claude 명령을 래핑하여 세션 추적 및 알림 훅을 삽입합니다. Claude Code 훅을 직접 관리하려면 비활성화하세요.
nb: Når aktivert, pakker cmux inn claude-kommandoen for å injisere sesjonssporing og varslingsmekanismer. Deaktiver hvis du foretrekker å håndtere Claude Code-mekanismer selv.
pl: Po włączeniu cmux opakowuje polecenie claude, aby wstrzyknąć śledzenie sesji i hooki powiadomień. Wyłącz, jeśli wolisz samodzielnie zarządzać hookami Claude Code.
pt_br: Quando ativado, o cmux encapsula o comando claude para injetar rastreamento de sessão e hooks de notificação. Desative se preferir gerenciar os hooks do Claude Code você mesmo.
ru: При включении cmux оборачивает команду claude для отслеживания сеансов и уведомлений. Отключите, если предпочитаете управлять хуками Claude Code самостоятельно.
th: เมื่อเปิดใช้งาน cmux จะห่อคำสั่ง claude เพื่อเพิ่มการติดตามเซสชันและตะขอการแจ้งเตือน ปิดใช้งานหากคุณต้องการจัดการตะขอ Claude Code ด้วยตัวเอง
tr: Etkinleştirildiğinde, cmux oturum izleme ve bildirim kancaları eklemek için claude komutunu sarar. Claude Code kancalarını kendiniz yönetmeyi tercih ediyorsanız devre dışı bırakın.
uk: Якщо увімкнено, cmux обгортає команду claude для інʼєкції відстеження сеансів та хуків сповіщень. Вимкніть, якщо бажаєте самостійно керувати хуками Claude Code.
zh_hans: 启用后，cmux 会包装 claude 命令以注入会话跟踪和通知钩子。如果您希望自行管理 Claude Code 钩子，请禁用此选项。
zh_hant: 啟用後，cmux 會包裝 claude 指令以注入工作階段追蹤和通知掛鉤。如果您偏好自行管理 Claude Code 掛鉤，請停用此選項。

# settings.automation.claudeCode.subtitleOff
source: Claude Code runs without cmux integration.
ar: يعمل Claude Code بدون تكامل cmux.
bs: Claude Code radi bez cmux integracije.
da: Claude Code kører uden cmux-integration.
de: Claude Code wird ohne cmux-Integration ausgeführt.
es: Claude Code se ejecuta sin integración con cmux.
fr: Claude Code s'exécute sans intégration cmux.
it: Claude Code viene eseguito senza integrazione cmux.
ja: Claude Codeはcmux連携なしで実行されます。
ko: Claude Code가 cmux 연동 없이 실행됩니다.
nb: Claude Code kjører uten cmux-integrering.
pl: Claude Code działa bez integracji z cmux.
pt_br: O Claude Code é executado sem integração com o cmux.
ru: Claude Code работает без интеграции с cmux.
th: Claude Code ทำงานโดยไม่มีการผสานรวม cmux
tr: Claude Code cmux entegrasyonu olmadan çalışır.
uk: Claude Code працює без інтеграції з cmux.
zh_hans: Claude Code 在没有 cmux 集成的情况下运行。
zh_hant: Claude Code 在不使用 cmux 整合的情況下運行。

# settings.automation.claudeCode.subtitleOn
source: Sidebar shows Claude session status and notifications.
ar: يعرض الشريط الجانبي حالة جلسة Claude والإشعارات.
bs: Bočna traka prikazuje status Claude sesije i obavještenja.
da: Sidebjælken viser Claude-sessionsstatus og notifikationer.
de: Die Seitenleiste zeigt den Claude-Sitzungsstatus und Benachrichtigungen an.
es: La barra lateral muestra el estado de la sesión de Claude y las notificaciones.
fr: La barre latérale affiche le statut de la session Claude et les notifications.
it: La barra laterale mostra lo stato della sessione Claude e le notifiche.
ja: サイドバーにClaudeセッションのステータスと通知が表示されます。
ko: 사이드바에 Claude 세션 상태와 알림이 표시됩니다.
nb: Sidepanelet viser Claude-sesjonsstatus og varsler.
pl: Pasek boczny pokazuje status sesji Claude i powiadomienia.
pt_br: A barra lateral mostra o status da sessão do Claude e notificações.
ru: Боковая панель показывает статус сеанса Claude и уведомления.
th: แถบด้านข้างแสดงสถานะเซสชัน Claude และการแจ้งเตือน
tr: Kenar çubuğu Claude oturum durumunu ve bildirimlerini gösterir.
uk: Бічна панель показує статус сеансу Claude та сповіщення.
zh_hans: 侧边栏显示 Claude 会话状态和通知。
zh_hant: 側邊欄顯示 Claude 工作階段狀態和通知。

# settings.automation.codex
source: Codex Integration
ar: تكامل Codex
es: Integración de Codex
fr: Intégration Codex
ja: Codex連携
ko: Codex 통합
zh_hans: Codex 集成
zh_hant: Codex 整合

# settings.automation.codex.note
source: When enabled, cmux wraps the codex command to inject session tracking and notification hooks. Disable if you prefer to manage Codex hooks yourself. cmux still tracks live Codex sessions it can observe even when this is off. To also track Codex launched through a custom launcher that bypasses the wrapper (e.g. a subrouter), run `cmux hooks setup --agent codex`, which installs hooks into ~/.codex/hooks.json.
ar: عند التمكين، يقوم cmux بلف أمر codex لحقن خطافات تتبع الجلسات والإشعارات. قم بتعطيله إذا كنت تفضل إدارة خطافات Codex بنفسك. لا يزال cmux يتتبع جلسات Codex المباشرة التي يمكنه مراقبتها حتى عند إيقاف تشغيل هذا الخيار. لتتبع Codex الذي تم إطلاقه عبر مشغل مخصص يتجاوز الغلاف أيضًا (مثل subrouter)، قم بتشغيل `cmux hooks setup --agent codex`، والذي يثبت الخطافات في ~/.codex/hooks.json.
de: Wenn aktiviert, umschließt cmux den Befehl codex, um Sitzungsverfolgung und Benachrichtigungs-Hooks zu integrieren. Deaktivieren Sie dies, wenn Sie Codex-Hooks lieber selbst verwalten möchten. cmux verfolgt weiterhin aktive Codex-Sitzungen, die es beobachten kann, selbst wenn dies ausgeschaltet ist. Um auch Codex-Sitzungen zu verfolgen, die über einen benutzerdefinierten Launcher gestartet wurden, der den Wrapper umgeht (z. B. einen Subrouter), führen Sie `cmux hooks setup --agent codex` aus, wodurch Hooks in ~/.codex/hooks.json installiert werden.
es: Cuando está habilitado, cmux envuelve el comando codex para inyectar ganchos de seguimiento de sesión y notificaciones. Desactívelo si prefiere administrar los ganchos de Codex usted mismo. cmux sigue realizando el seguimiento de las sesiones activas de Codex que pueda observar incluso cuando esto está desactivado. Para realizar también el seguimiento de Codex iniciado a través de un lanzador personalizado que omita la envoltura (p. ej., un subrouter), ejecute `cmux hooks setup --agent codex`, que instala ganchos en ~/.codex/hooks.json.
fr: Lorsqu’elle est activée, cmux enveloppe la commande codex pour injecter le suivi de session et les hooks de notification. Désactivez cette option si vous préférez gérer les hooks Codex vous-même. cmux suit toujours les sessions Codex en direct qu’il peut observer, même lorsque cette option est désactivée. Pour suivre également les sessions Codex lancées via un lanceur personnalisé qui contourne l’enveloppe (par ex. un sous-routeur), exécutez `cmux hooks setup --agent codex`, ce qui installe des hooks dans ~/.codex/hooks.json.
ja: 有効にすると、cmuxはcodexコマンドをラップしてセッション追跡と通知フックを注入します。Codexのフックを自分で管理したい場合は無効にしてください。無効でも、cmuxは観測できるライブCodexセッションを追跡します。ラッパーをバイパスするカスタムランチャー（例: サブルーター）経由で起動したCodexも追跡するには、`cmux hooks setup --agent codex` を実行してください。これは ~/.codex/hooks.json にフックをインストールします。
ko: 활성화하면 cmux가 codex 명령을 래핑하여 세션 추적 및 알림 훅을 주입합니다. Codex 훅을 직접 관리하려면 비활성화하십시오. 이 설정이 꺼져 있어도 cmux는 감지 가능한 활성 Codex 세션을 추적합니다. 래퍼를 우회하는 맞춤 실행기(예: 하위 라우터)를 통해 실행된 Codex도 추적하려면, `cmux hooks setup --agent codex`를 실행하여 ~/.codex/hooks.json에 훅을 설치하십시오.
zh_hans: 启用后，cmux 会包装 codex 命令以注入会话跟踪和通知钩子。如果希望自行管理 Codex 钩子，请禁用此选项。即使关闭，cmux 仍会跟踪它能观察到的活动 Codex 会话。若还要跟踪通过绕过包装器的自定义启动器（例如子路由器）启动的 Codex，请运行 `cmux hooks setup --agent codex`，它会将钩子安装到 ~/.codex/hooks.json。
zh_hant: 啟用時，cmux 會包裝 codex 命令以插入工作階段追蹤與通知掛鉤（hook）。如果您偏好自行管理 Codex 掛鉤，請停用此功能。即使關閉此功能，cmux 仍會追蹤其可觀察到的作用中 Codex 工作階段。若要同時追蹤透過略過包裝器的自訂啟動器（例如子路由器）啟動的 Codex，請執行 `cmux hooks setup --agent codex`，這會將掛鉤安裝至 ~/.codex/hooks.json。

# settings.automation.codex.subtitleOff
source: Codex runs without cmux integration.
ar: يعمل Codex دون تكامل مع cmux.
de: Codex läuft ohne cmux-Integration.
es: Codex se ejecuta sin integración con cmux.
fr: Codex s’exécute sans intégration cmux.
ja: Codexはcmux連携なしで実行されます。
ko: Codex가 cmux 통합 없이 실행됩니다.
zh_hans: Codex 在不集成 cmux 的情况下运行。
zh_hant: Codex 執行時不與 cmux 整合。

# settings.automation.codex.subtitleOn
source: Sidebar shows Codex session status and notifications.
ar: يعرض الشريط الجانبي حالة جلسة Codex وإشعاراتها.
de: Die Seitenleiste zeigt den Status der Codex-Sitzung sowie Benachrichtigungen an.
es: La barra lateral muestra el estado de la sesión de Codex y las notificaciones.
fr: La barre latérale affiche le statut de la session Codex et ses notifications.
ja: サイドバーにCodexセッションの状態と通知が表示されます。
ko: 사이드바에 Codex 세션 상태 및 알림이 표시됩니다.
zh_hans: 侧边栏显示 Codex 会话状态和通知。
zh_hant: 側邊欄會顯示 Codex 工作階段狀態與通知。

# settings.automation.cursor
source: Cursor Integration
ar: تكامل Cursor
es: Integración de Cursor
fr: Intégration Cursor
ja: Cursor連携
ko: Cursor 연동
zh_hans: Cursor 集成
zh_hant: Cursor 整合

# settings.automation.cursor.note
source: Hooks must be installed with `cmux hooks cursor install`. They no-op outside cmux terminals.
ar: يجب تثبيت الخطافات باستخدام `cmux hooks cursor install`. وهي لا تؤدي أي وظيفة خارج طرفيات cmux.
de: Hooks müssen mit `cmux hooks cursor install` installiert werden. Sie haben außerhalb von cmux-Terminals keine Funktion (no-op).
es: Los ganchos se deben instalar con `cmux hooks cursor install`. No realizan ninguna operación fuera de las terminales de cmux.
fr: Les hooks doivent être installés avec `cmux hooks cursor install`. Ils n’ont aucun effet en dehors des terminaux cmux.
ja: フックは`cmux hooks cursor install`でインストールする必要があります。cmuxターミナル外では動作しません。
ko: `cmux hooks cursor install`로 훅을 설치해야 합니다. cmux 터미널 외부에서는 작동하지 않습니다.
zh_hans: 必须用 `cmux hooks cursor install` 安装钩子。它们在 cmux 终端之外不生效。
zh_hant: 必須透過 `cmux hooks cursor install` 安裝 Hook。它們在 cmux 終端機外不會執行任何操作。

# settings.automation.cursor.subtitleOff
source: Cursor runs without cmux integration.
ar: يعمل Cursor دون تكامل مع cmux.
de: Cursor läuft ohne cmux-Integration.
es: Cursor se ejecuta sin integración con cmux.
fr: Cursor s’exécute sans intégration cmux.
ja: Cursorはcmux連携なしで動作します。
ko: Cursor가 cmux 연동 없이 실행됩니다.
zh_hans: Cursor 在不集成 cmux 的情况下运行。
zh_hant: Cursor 執行時未與 cmux 整合。

# settings.automation.cursor.subtitleOn
source: Sidebar shows Cursor agent status and notifications.
ar: يعرض الشريط الجانبي حالة عميل Cursor وإشعاراته.
de: Die Seitenleiste zeigt den Status des Cursor-Agenten sowie Benachrichtigungen an.
es: La barra lateral muestra el estado del agente de Cursor y las notificaciones.
fr: La barre latérale affiche le statut de l’agent Cursor et ses notifications.
ja: サイドバーにCursorエージェントのステータスと通知が表示されます。
ko: 사이드바에 Cursor 에이전트 상태와 알림이 표시됩니다.
zh_hans: 侧边栏显示 Cursor 代理状态和通知。
zh_hant: 側邊欄會顯示 Cursor 代理程式狀態與通知。

# settings.automation.gemini
source: Gemini CLI Integration
ar: تكامل واجهة خط أوامر Gemini (CLI)
es: Integración de Gemini CLI
fr: Intégration Gemini CLI
ja: Gemini CLI連携
ko: Gemini CLI 연동
zh_hans: Gemini CLI 集成
zh_hant: Gemini CLI 整合
